[
	{
		"name": "story_radiation",
		"title": "ABNORMAL RADIATION READINGS",
		"content": "Science department is reporting unusual radiation levels on the planet below.",
		"options":
		[{
			"choice": "Send scouting party",
			"diceRoll": true,
			"winChance": 0.25,
			"win": {
				"response": "The scouts are gone for a long time. When they return, exhausted, they bring fifteen canisters of starship fuel!",
				"effect" : {"resource_fuel" : 15}
			},
			"fail": {
				"response": "The landing craft enters the ionosphere and immediately loses contact. You wait for hours, but they don't return.",
				"effect" : {"resource_crew" : -8, "resource_happiness" : -15}
			}
		}, {
			"choice": "Ignore the readings",
			"diceRoll": false,
			"response": "You broadcast a data packet in case it's of use to someone else. Time to move on.",
			"effect": null
		}]
	},
	{
		"name": "story_fight",
		"title": "ASSAULT ON BOARD",
		"content": "Head of Security [NAME_SECURITY] takes you aside at breakfast. A junior engineer has seriously assaulted a colleague. There is no brig on board.",
		"options":
		[{
			"choice": "Fire him out the airlock",
			"diceRoll": true,
			"winChance": 0.8,
			"win": {
				"response": "[NAME_SECURITY] nods and immediately leaves the mess hall. It's a hard decision, but you can't tolerate violence onboard.",
				"effect" : {"resource_crew" : -1}
			},
			"fail": {
				"response": "[NAME_SECURITY] leaves and, the next day, brings you the report of the incident. The perpetrator made a scene. Everyone knows.",
				"effect" : {"resource_crew" : -1, "resource_happiness" : -20}
			}
		}, {
			"choice": "Keep the incident under wraps",
			"diceRoll": false,
			"response": "[NAME_SECURITY] doesn't seem happy about it, but talks to the victim and convinces them to keep quiet. You transfer him to another department.",
			"effect" : {"resource_happiness" : -5}
		}]
	},
	{
		"name": "story_riot",
		"title": "SECURITY ALERT",
		"content": "[NAME_SECURITY] buzzes you at lunch. Yelling to be heard, she tells you that a group of malcontents have started a riot in the mess hall. They've had enough travelling.",
		"options":
		[{
			"choice": "Have [NAME_SECURITY] arrest them",
			"diceRoll": true,
			"winChance": 0.7,
			"win": {
				"response": "[NAME_SECURITY] moves officers in quickly and incapacitates the troublemakers. They end up spending a few days in the brig, and order is restored - if not peace.",
				"effect" : {"resource_happiness" : -18}
			},
			"fail": {
				"response": "[NAME_SECURITY] rushes in to quell the disturbance. The violence escalates and few people get out unscathed. This won't help.",
				"effect" : {"resource_crew" : -3, "resource_happiness" : -39}
			}
		}, {
			"choice": "Let [NAME_SECURITY] talk them down",
			"diceRoll": true,
			"winChance": 0.2,
			"win": {
				"response": "[NAME_SECURITY] offers an increase in food rations and more flexibility in work shifts. A dialogue is opened, and eventually the troublemakers settle down, relieved to have been listened to.",
				"effect" : {"resource_happiness" : 24}
			},
			"fail": {
				"response": "[NAME_SECURITY] hangs up and, from what you can piece together later, tries to convince them of their folly. It doesn't go well. Medbay fills up, but at least nobody died.",
				"effect" : {"resource_happiness" : -17}
			}
		}]
	},
	{
		"name": "story_spaceWalk",
		"title": "PERSONAL ALARM TRIGGERED",
		"content": "A member of the maintenance team has suffered an O2 tank puncture while cleaning the solar array, and now they're being propelled into space. Soon they'll be too far gone to retrieve.",
		"options":
		[{
			"choice": "Send someone after them",
			"diceRoll": true,
			"winChance": 0.4,
			"win": {
				"response": "[NAME_SECURITY] volunteers to go and you know better than to argue. Fifteen minutes later they've both been reeled back in, and the bridge everyone breathes a collective sigh of relief.",
				"effect" : {"resource_happiness" : 12}
			},
			"fail": {
				"response": "An intern volunteers and you reluctantly let them go. They make the leap and manage to thrust close enough to latch on - but then the O2 tank ruptures and sends them both spinning into the dark, too fast to catch.",
				"effect" : {"resource_crew" : -2, "resource_happiness" : -13}
			}
		}, {
			"choice": "Send a team after them",
			"diceRoll": true,
			"winChance": 0.8,
			"win": {
				"response": "[NAME_SECURITY] assembles a team of five and leads them out into the dark. [NAME_PILOT] adjusts the ship's orientation slightly and keeps the team in range long enough for everyone to come back safe.",
				"effect" : {"resource_happiness" : 14, "resource_fuel" : -3}
			},
			"fail": {
				"response": "[NAME_SECURITY] sends a team out. It looks like they're going to pull back with no trouble, but then another rogue micrometeorite strikes. There's an O2 explosion, and when the debris clears you can't find anyone.",
				"effect" : {"resource_happiness" : -30, "resource_crew" : -5}
			}
		}, {
			"choice": "Don't send anyone",
			"diceRoll": false,
			"response": "[NAME_PILOT] tries to argue, but you've made your decision. You can't risk anyone else. [NAME_ENGINEER] keeps the channel open so you have to listen as the maintenance officer drifts away, alone.",
			"effect" : {"resource_crew" : -1, "resource_happiness" : -21}
		}]
	},
	{
        "name": "story_podVials",
        "title": "OBJECT RECOVERED",
        "content": "Maintenance has brought aboard some kind of escape pod from a nearby debris field. The design is unfamiliar to you, and it's covered in strange burn patterns.",
        "options": [
            {
                "choice": "Open it",
                "diceRoll": true,
                "winChance": 0.8,
                "win": {
                    "response": "Your crew brings it aboard and you inspect it in the cargo bay. [NAME_ENGINEER] gets it open, revealing an old-fashioned interior speckled with blood. No body.",
					"effect": {"resource_happiness": -2}
                },
                "fail": {
                    "response": "They get it aboard and force it open. Inside is a pile of broken vials, and within minutes people start to throw up. [NAME_ENGINEER] seals and vents the cargo bay just in time.",
					"effect": {"resource_crew": -9, "resource_happiness": -12}
                }
            },
            {
                "choice": "Destroy it",
                "diceRoll": true,
                "winChance": 0.9,
                "win": {
                    "response": "You order them to recycle it, but [NAME_ENGINEER] insists you incinerate it in the drive chamber. It burns up quickly enough. Safer this way.",
					"effect" : null
                },
                "fail": {
                    "response": "You order them to recycle it. When it enters the crusher it releases some kind of bio-agent and the waste team fall ill very quickly.",
					"effect": {"resource_crew": -4, "resource_happiness": -8}
                }
            }
        ]
    },
    {
        "name": "story_podSupplies",
        "title": "OBJECT RECOVERED",
        "content": "Maintenance has brought aboard some kind of escape pod from a nearby debris field. The design is unfamiliar to you, and it's covered in strange burn patterns.",
        "options": [
            {
                "choice": "Open it",
                "diceRoll": true,
                "winChance": 0.5,
                "win": {
                    "response": "Your crew brings it aboard and you inspect it in the cargo bay. You open it to find it's full to the brim with restaurant-quality food supplies. Bizarre, but welcome.",
					"effect": {"resource_happiness": 12}
                },
                "fail": {
                    "response": "They get it aboard and force it open. Inside is a long-dead Imperial soldier and a large supply of food, all spoiled. It sets everyone on edge.",
					"effect": {"resource_happiness": -3}
                }
            },
            {
                "choice": "Destroy it",
                "diceRoll": true,
                "winChance": 0.8,
                "win": {
                    "response": "You order the pod jettisoned into the nearest asteroid. It explodes violently on impact, shrapnel bursting into fireworks on your shield. It's a good show.",
					"effect": {"resource_happiness": 6}
                },
                "fail": {
                    "response": "The pod is put through the huge recycling centre belowdecks. At the other end it becomes apparent that it contained food supplies, now ruined.",
					"effect": {"resource_happiness": -12}
                }
            }
        ]
    },
	
    {
        "name": "story_lost",
        "title": "MAPPING ERROR",
        "content": "You call for engineering to prime the jump drive, but [NAME_NAVIGATOR] interrupts. Apparently the mapping system glitched and you've ended up nowhere near the jump beacon.",
        "options": [
            {
                "choice": "Jump anyway",
                "diceRoll": true,
                "winChance": 0,
                "win": {
                    "response": "null"
                },
                "fail": {
                    "response": "The drive makes a noise like birdsong in reverse. When you regain consciousness, you learn several people are in medical with massive blood loss.",
					"effect": {"resource_happiness": -7, "resource_crew": -3}			
                }
            },
            {
                "choice": "Navigate manually",
                "diceRoll": false,
                "response": "It takes all night to correct your course and make it to the node. Everyone's tired and angry, but it's much safer than jumping blind.",
				"effect": {"resource_happiness": -4}
            }
        ]
    },
    {
        "name": "story_tapping",
        "title": "TAP TAP TAP",
        "content": "You hear a tapping from an overhead storage locker on the bridge. [NAME_NAVIGATOR] looks at you with some degree of concern.",
        "options": [
            {
                "choice": "Open locker",
                "diceRoll": true,
                "winChance": 0.95,
                "win": {
                    "response": "You open the locker. A ginger cat leaps down and yowls at you - a hungry stowaway! It takes up residence on the bridge.",
					"effect": {"resource_happiness": 5}
                },
                "fail": {
                    "response": "You open the locker and a metronome falls out, striking your assistant navigator on the head. He later succumbs to his injury.",
					"effect": {"resource_happiness": -7, "resource_crew": -1}
                }
            },
            {
                "choice": "Reassure self",
                "diceRoll": false,
                "response": "You tell yourself you're imagining things and order the crew onwards. [NAME_NAVIGATOR] watches you with fearful eyes.",
				"effect": {"resource_happiness": -4}
            }
        ]
    }
]